app/controllers/posts_controller.rb

    def index
        @posts = Post.all.order(updated_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."updated_at" DESC

    def show
        id = params[:id]
        @post = Post.find(id)
        @comment = Comment.new
        @comments = @post.comments.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", 1]]

    def destroy
        id = params[:id]
        @post = Post.find(id)
        @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]